///*++
//Copyright (c) 2006 Byosoft Corporation. All rights reserved.
//This software and associated documentation (if any) is furnished
//under a license and may only be used or copied in accordance
//with the terms of the license. Except as permitted by such
//license, no part of this software or documentation may be
//reproduced, stored in a retrieval system, or transmitted in any
//form or by any means without the express written consent of
//Byosoft Corporation.
//
//Module Name:
//
//  Network.uni
//
//Abstract:
//
// Network Configuration Form String Definitions
//--*/
/=#
#langdef   en-US "English"

#string STR_NETWORK_SETUP_FORM                 #language en-US "Network Setup"
                                               #language zh-Hans "\wide网络菜单\narrow"
#string STR_NETWORK_SETUP_FORM_HELP            #language en-US "Select this option to configure your system's network."
                                               #language zh-Hans "\wide选择此选项可配置系统的网络设备.\narrow"

#string STR_ONBOARD_ETHERNET_CONTROLLER        #language en-US "Onboard Ethernet Controller"
                                               #language zh-Hans "\wide板载网卡控制\narrow"
#string STR_ONBOARD_ETHERNET_CONTROLLER_HELP   #language en-US "Select whether to enable or disable Onboard Ethernet Controller."
                                               #language zh-Hans "\wide选择是否打开板载网卡功能\narrow"

#string STR_BOOT_AGENT                         #language en-US "Legacy PXE Boot"
                                               #language zh-Hans "\wide传统网络启动\narrow"
#string STR_BOOT_AGENT_HELP                    #language en-US "Select to load onboard PXE (Preboot Execution Environment) or not, This feature will allow the computer to boot from a server image. This Feature need Csm enable in Startup page"
                                               #language zh-Hans "\wide选择是否加载\narrow传统PXE\wide（预执行环境）启动代理功能。\narrow"

#string STR_PXE_IPV4                           #language en-US "PXE IPV4 network stack"
                                               #language zh-Hans "IPV4\wide协议\narrow"
#string STR_PXE_IPV4_HELP                      #language en-US "Select whether to enable or disable PXE IPV4 network stack. Please disable Legacy PXE Boot first"
                                               #language zh-Hans "\wide选择是否打开或者关闭\narrowIPV4\wide协议\narrow"

#string STR_PXE_IPV6                           #language en-US "PXE IPV6 network stack"
                                               #language zh-Hans "IPV6\wide协议\narrow"
#string STR_PXE_IPV6_HELP                      #language en-US "Select whether to enable or disable PXE IPV6 network stack. Please disable Legacy PXE Boot first"
                                               #language zh-Hans "\wide选择是否打开或者关闭\narrowIPV6\wide协议\narrow"